emacs-config.org
#+title: Emacs configuration
#+author: Kristoffer Balintona
#+email: krisbalintona@gmail.com
#+language: en_US
#+options: num:t author:t email:t
#+property: header-args :noweb yes

* About this document

See =(org) Noweb Reference Syntax= for information on org's noweb syntax.

Preview org blocks with noweb syntax with ~org-babel-expand-src-block~, bound to =C-c C-v C-v= and =C-c C-v v= by default.

See also the useful command ~org-babel-goto-named-src-block~ and other useful commands in =(org) Key bindings and Useful Functions=.

* Personal information

#+name: bio
#+begin_src emacs-lisp
  (setopt user-full-name "Kristoffer Balintona"
          user-mail-address "krisbalintona@gmail.com")
#+end_src

* Emacs package management

** Always load newest byte code

#+begin_src emacs-lisp :noweb-ref emacs-misc
  ;; Always load newest byte code
  (setopt load-prefer-newer t)
#+end_src

** Be verbose: message when any file is loaded

For the sake of debugging my config file and ensuring a reasonable startup speed, I make sure a message is printed every time a package is loaded.
#+name: load-messages
#+begin_src emacs-lisp
  (setq force-load-messages t)
#+end_src

** Add my WIP "monkey patches" directory to ~load-path~

#+name: wip
#+begin_src emacs-lisp
  (defvar krisb-wip-monkeypatches-dir (expand-file-name "wip" user-emacs-directory)
    "Directory holding my WIP \"monkey patches.\"
  \"Monkey patches\" are files that are different version of upstream
  files.  Either for third-party packages or Emacs itself.

  This directory is added to `load-path' in order for these WIP files to
  be loaded instead of their upstream versions.  This allows me to work on
  patches to, say, org-mode or Emacs, by loading those versions at
  startup.")

  (unless (file-exists-p krisb-wip-monkeypatches-dir)
    (message "Making directory %s..." krisb-wip-monkeypatches-dir)
    (make-directory krisb-wip-monkeypatches-dir))

  (add-to-list 'load-path krisb-wip-monkeypatches-dir)

  ;; Symbolically link my monkeypatches to `krisb-wip-monkeypatches-dir'
  (defmacro krisb-wip-monkeypatch-symlink (path)
    "Symlink PATH into `krisb-wip-monkeypatches-dir'.
  If PATH is already symlinked into `krisb-wip-monkeypatches-dir', then do
  nothing."
    `(let* ((patch-path (expand-file-name ,path))
            (link-path
             (expand-file-name (file-name-nondirectory patch-path) krisb-wip-monkeypatches-dir)))
       (unless (file-exists-p link-path)
         (message "Symlinking %s to %s..." patch-path link-path)
         (make-symbolic-link patch-path link-path))))

  <<link-monkeypatches>>
#+end_src

** Package.el

#+name: package.el
#+begin_src emacs-lisp
  (setopt package-archives '(("gnu-elpa" . "https://elpa.gnu.org/packages/")
                             ("gnu-elpa-devel" . "https://elpa.gnu.org/devel/")
                             ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                             ("melpa" . "https://melpa.org/packages/"))
          package-archive-priorities '(("gnu-elpa" . 4)
                                       ("nongnu" . 3)
                                       ("gnu-elpa-devel" . 2)
                                       ("melpa" . 1))
          package-install-upgrade-built-in t)

  ;; 2025-10-23 TODO: Revisit this.  Ideally, should be more safe than
  ;; setting this value to an outright t
  (setopt package-vc-allow-build-commands t)
#+end_src

I also relativize the packages that package.el installs by Emacs version, since I sometimes run different versions of Emacs to test packages, and bytecode incompatibilities might arise between my compiled Emacs and the package.el packages. I make sure to place this before ~package-initialize~ is called; therefore, unless ~package-enable-at-startup~ is nil, this should be placed in early-init.el.
#+name: package-relativize-version
#+begin_src emacs-lisp
  ;; Install package.el packages into separate directories for each
  ;; Emacs version, to prevent bytecode incompatibility.
  ;; 
  ;; I had this idea myself, but I this specific implementation is
  ;; nearly identical to the one in from
  ;; https://github.com/purcell/emacs.d.
  (setopt package-user-dir
          (expand-file-name (format "elpa/%s.%s" emacs-major-version emacs-minor-version)
                            user-emacs-directory))
#+end_src

*** Try: Try out Emacs packages

#+name: try
#+begin_src emacs-lisp
  (setup try
    (:package try))
#+end_src

*** Package-guard-upgrade

See a diff of files before upgrading a package through package.el's tarballs:
#+name: package-guard-upgrade
#+begin_src emacs-lisp
  (setup package-upgrade-guard
    (:package (package-upgrade-guard :url "https://github.com/kn66/package-upgrade-guard.el.git"))
    
    (package-upgrade-guard-mode 1))
#+end_src

** Elpaca

#+name: elpaca
#+begin_src emacs-lisp
#+end_src

* Meta-configuration

** Bespoke helpers and variables

#+name: config-helpers
#+begin_src emacs-lisp
  ;;;;; Variables
  ;; FIXME 2025-05-20: If the path denoted by `krisb-folio-directory'
  ;; does not exist, other packages that depend on this value are given
  ;; a non-existing path, likely resulting in errors.  We might solve
  ;; this by turning this into a function instead, returning nil if it
  ;; doesn't exist, thereby avoiding passing a non-existing file path to
  ;; these packages.
  (defvar krisb-folio-directory (expand-file-name "org-database" "~/Documents")
    "The directory holding my org files.")

  (defvar krisb-notes-directory (expand-file-name "notes" krisb-folio-directory)
    "My notes directory.")

  (defvar krisb-org-agenda-directory (expand-file-name "agenda" krisb-folio-directory)
    "The directory holding my main org-agenda files.")

  (defvar krisb-org-agenda-main-file (expand-file-name "todo.org" krisb-org-agenda-directory)
    "My main org-agenda file.")

  (defvar krisb-org-archive-directory (expand-file-name "archive" krisb-folio-directory)
    "The archive directory for my org files.")

  (defvar krisb-bibliography-files (list (expand-file-name "master-lib.bib" krisb-folio-directory))
    "A list of my bibliography (.bib) files.")

  ;;;;; Directories
  (defvar krisb-blog-manuscripts-directory (expand-file-name "manuscripts/blog" krisb-notes-directory)
    "The directory for my pre-export blog files.")

  (defvar krisb-email-directory (expand-file-name "emails/" "~/Documents/")
    "Directory that houses my local email files.")

  (defvar krisb-email-drafts-directory (expand-file-name "drafts" krisb-email-directory)
    "Directory that houses my local email drafts.")

  ;;;;; Functions
  (defun krisb-wayland-p ()
    "Return non-nil if Emacs is under Wayland."
    (getenv "WAYLAND_DISPLAY"))

  ;;;;; Keymaps
  (defvar-keymap krisb-note-keymap
    :doc "Prefix for my note-taking needs.")
  (bind-key "C-c n" krisb-note-keymap 'global-map)

  (defvar-keymap krisb-open-keymap
    :doc "Prefix for opening various hings.")
  (bind-key "C-c o" krisb-open-keymap 'global-map)

  (defvar-keymap krisb-toggle-keymap
    :doc "Prefix for toggling stuff.")
  (bind-key "C-c t" krisb-toggle-keymap 'global-map)
#+end_src

** Add bespoke lisp modules to ~load-path~

#+name: site-lisp
#+begin_src emacs-lisp
  (dolist (path (list (expand-file-name "modules" user-emacs-directory)
                      (expand-file-name "lisp" user-emacs-directory)))
    (add-to-list 'load-path path))
#+end_src

** Setup.el: A transparent =use-package= alternative

Setup.el simply provides various macros inside ~(setup ...)~ forms. It comes with many of its own while making it easy for users to define their own macros. Macros are useful for Emacs configuration: they reduce repetition and boilerplate. See setup's Emacs Wiki page: [[https://www.emacswiki.org/emacs/SetupEl][EmacsWiki: Setup El]].

#+name: setup.el
#+begin_src emacs-lisp
  (unless (package-installed-p 'setup)
    (package-install 'setup))

  ;; Define my own setup.el macros
  (with-eval-after-load 'setup
    ;; Mimic use-package's :after keyword.  Taken from
    ;; https://www.emacswiki.org/emacs/SetupEl#h5o-10.
    (setup-define :load-after
      (lambda (&rest features)
        (let ((body `(require ',(setup-get 'feature))))
          (dolist (feature (nreverse features))
            (setq body `(with-eval-after-load ',feature ,body)))
          body))
      :documentation "Load the current feature after FEATURES."
      :debug '(symbolp listp))

    ;; Make adding advice easier.  Modified from
    ;; https://www.emacswiki.org/emacs/SetupEl#h5o-13.
    (setup-define :advice-def
      (lambda (symbol where suffix arglist &rest body)
        (let ((name (concat "setup-advice-" suffix)))
          `(progn
             (defun ,name ,arglist ,@body)
             (advice-add ',symbol ,where #',name))))
      :documentation "Add a piece of advice on a function.
  Provide a function symbol, a HOW from `advice-add', a string that acts
  as the suffix for the advice name, and the advice function definition.
  See `advice-add' for more details."
      :debug '(sexp sexp sexp function-form)
      :after-loaded t
      :indent 3)

    (setup-define :advice
      (lambda (symbol where)
        `(advice-add ',symbol ,where #',(setup-get 'func)))
      :documentation "Advise a function the current function.
  Provide a function symbol and a HOW from `advice-add'.  See `advice-add'
  for more details."
      :debug '(sexp sexp)
      :after-loaded t)

    ;; Mide a minor mode from the mode-line.  Modified from
    ;; https://www.emacswiki.org/emacs/SetupEl#h5o-11.
    (setup-define :hide-mode
      (lambda (&optional mode)
        (let* ((mode (or mode (setup-get 'mode)))
               (mode (if (string-match-p "-mode\\'" (symbol-name mode))
                         mode
                       (intern (format "%s-mode" mode)))))
          (if (boundp 'mode-line-collapse-minor-modes) ; Added in Emacs 31.1
              `(add-to-list 'mode-line-collapse-minor-modes ',mode)
            `(setq minor-mode-alist
                   (delq (assq ',mode minor-mode-alist)
                         minor-mode-alist)))))
      :documentation "Hide the mode-line lighter of the current mode.
  Alternatively, MODE can be specified manually, and override the current
  mode.

  If `mode-line-collapse-minor-modes' exists, add the current mode to
  that.  Otherwise, remove it from `minor-mode-alist'."
      :after-loaded t)

    ;; Customize faces.  Taken from
    ;; https://www.emacswiki.org/emacs/SetupEl#h5o-22.
    (setup-define :face
      (lambda (face spec) `(custom-set-faces (backquote (,face ,spec))))
      :documentation "Customize FACE to SPEC."
      :signature '(face spec ...)
      :debug '(setup)
      :repeatable t
      :after-loaded t)

    ;; Macro for `bind-keys'
    (setup-define :bind-keys
      (lambda (&rest args)
        `(bind-keys ,@args))
      :documentation "Bind KEY to COMMAND in current map."
      :after-loaded t)

    ;; Macro for `executable-find'.  Taken from
    ;; https://github.com/hiecaq/guix-config?tab=readme-ov-file#setupel
    (setup-define :needs
      (lambda (executable)
        `(unless (executable-find ,executable)
           ,(setup-quit)))
      :documentation "If EXECUTABLE is not in the path, stop here."
      :debug '(form))

    ;; Redefine :require macro to use current feature.
    (setup-define :require
      (lambda () `(require ',(setup-get 'feature) nil t))
      :documentation "Try to require the current feature, or stop evaluating body.")

    ;; Catch `setup-quit' within a scope.  Taken from
    ;; https://www.emacswiki.org/emacs/SetupEl#h5o-9
    (setup-define :with-local-quit
      (lambda (&rest body)
        `(catch ',(setup-get 'quit)
           ,@body))
      :documentation "Prevent any reason to abort from leaving beyond BODY."
      :debug '(setup))
    
    ;; Unconditional quit.  Taken from
    ;; https://www.emacswiki.org/emacs/SetupEl#h5o-8.
    (setup-define :quit
      #'setup-quit
      :documentation "Unconditionally abort the evaluation of the current body.")

    ;; Macro for adding to `package-pinned-packages'.  To use properly,
    ;; make sure this is placed before any calls to `package-install'
    ;; (e.g., via :package) for every pinned package.
    (setup-define :pin
      (lambda (package archive)
        `(add-to-list 'package-pinned-packages '(,package ,archive)))
      :documentation "Pin PACKAGE to ARCHIVE.
  PACKAGE is a symbol representing a package.  ARCHIVE is a string
  representing an archive (it should be the car of an element in
  package-archives, e.g. \"gnu\")."))

  ;; Add setup entries to imenu.  Modified from
  ;; https://www.emacswiki.org/emacs/SetupEl#h5o-31.
  (with-eval-after-load 'setup
    (with-eval-after-load 'imenu
      (defun krisb-setup-with-imenu ()
        "Configure imenu to identify setup.el forms."
        (setf (map-elt imenu-generic-expression "Setup")
              (list (rx line-start (0+ blank)
                        "(setup" (1+ blank)
                        ;; Add here items that can define a feature:
                        (or (group-n 1 (1+ (or (syntax word)
                                               (syntax symbol))))
                            (seq "(:" (or "package" "elpaca" "require")
                                 (1+ blank)
                                 (group-n 1 (1+ (or (syntax word)
                                                    (syntax symbol)))))))
                    1)))
      (add-hook 'emacs-lisp-mode-hook #'krisb-setup-with-imenu)

      (with-eval-after-load 'consult-imenu
        (push '(?s "Setup")
              (plist-get (cdr (assoc 'emacs-lisp-mode consult-imenu-config)) :types)))))
#+end_src

*** Why use setup.el over use-package?

In my opinion, use-package's macros add an opaqueness that adds a layer of potential confusion. One has to learn the specific "use-package language"---avoiding all its foot-guns and practicing its conventions---in order to configure their Emacs. Instead, I prefer setup.el because it's simply a bunch of straightforward elisp macros.

This lets setup.el configurations be transparent rather than opaque: I understand exactly what elisp is at play and what it's doing. Consequently, I think configurations leveraging setup.el require no special know-how or caution to write or understand---I wouldn't say the same for use-package.

