emacs-config.org
** No-littering.el: keep a tidy =.emacs.d/=

# TODO 2025-11-10: Look into having package-user-dir follow no-littering's conventions? Should be in
# no-littering-var-directory, I think.

#+name: no-littering
#+begin_src emacs-lisp
  ;; Have packages write their files in locations adhering to a
  ;; convention.
  (setup no-littering
    (:package no-littering)

    ;; Set the package options according to the instructions found in
    ;; the package commentary.
    (eval-and-compile       ; Ensure values don't differ at compile time
      (setq no-littering-etc-directory (expand-file-name "etc/" user-emacs-directory) ; Config files
            no-littering-var-directory (expand-file-name "var/" user-emacs-directory))) ; Persistent files
    ;; Ensure the directories exist
    (mkdir no-littering-etc-directory t)
    (mkdir no-littering-var-directory t)

    ;; Require only after setting `no-littering-etc-directory' and
    ;; `no-littering-var-directory'
    (:require)

    ;; Sets more secure values for `auto-save-file-name-transforms',
    ;; `backup-directory-alist', and
    ;; `undo-tree-history-directory-alist'.  Read docstring for a more
    ;; detailed explanation.
    (no-littering-theme-backups))
#+end_src

We also do this:
#+name: no-littering-eln-cache
#+begin_src emacs-lisp
  ;; Redirect the .eln cache to a directory that adheres to
  ;; no-littering's convention of placing data files in the var
  ;; subdirectory.  Taken from
  ;; https://github.com/emacscollective/no-littering?tab=readme-ov-file#native-compilation-cache
  (when (and (fboundp 'startup-redirect-eln-cache)
             (fboundp 'native-comp-available-p)
             (native-comp-available-p))
    (startup-redirect-eln-cache
     (convert-standard-filename
      (expand-file-name  "var/eln-cache/" user-emacs-directory))))
#+end_src

** On.el: Add hooks that help startup times

#+name: on.el
#+begin_src emacs-lisp
  ;; Package exposes a number of utility hooks and functions ported from
  ;; Doom Emacs.  The hooks make it easier to speed up Emacs startup by
  ;; providing finer-grained control of the timing at which packages are
  ;; loaded.  Provides the following hooks:
  ;; - `on-first-input-hook'
  ;; - `on-init-ui-hook'
  ;; - `on-first-file-hook'
  ;; - `on-switch-frame-hook'
  ;; - `on-first-buffer-hook'
  ;; - `on-switch-buffer-hook'
  ;; - `on-switch-window-hook'
  (setup on
    (:package on)
    (:require))
#+end_src

** El-patch: override packages in a future-proof way

There is a problem when we use the typical ~(advice-add ... :override ...)~, namely, upstream definitions may change. This either renders our override unnecessary or our new function incompatible with the rest of upstream. El-patch provides a way to override functions while becoming aware of any upstream changes to the function we originally intended to override.

#+name: el-patch
#+begin_src emacs-lisp
  (setup el-patch
    ;; Elpaca: :ensure (:wait t)
    (:package el-patch)
    (:require))
#+end_src

# TODO 2025-06-03: Describe relation to https://elpa.gnu.org/packages/advice-patch.html.

** Dealing with ~custom-file~

We use a snippet like the one below to set and load the ~custom-file~:
#+name: set-and-load-custom-file
#+begin_src emacs-lisp
  ;;; Set and load custom file
  (setopt custom-file (no-littering-expand-etc-file-name "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file))
#+end_src

Alternatively, one could have a "temporary" custom file to avoid loading any customization set there so that changes set in one Emacs session don't accidentally persist across confusing me and potentially interfering with, e.g., my package.el configuration. This is one method to do so:
#+name: just-set-custom-file
#+begin_src emacs-lisp
  ;;; Set `custom-file' but do not load it
  ;; Write `custom-file' in a temporary directory but don't load it.
  ;; This is just to avoid writing Custom options to the
  ;; `user-init-file'.  See
  ;; https://protesilaos.com/emacs/dotemacs#h:f2ffe0e9-a58d-4bba-9831-cc35940ea83f
  ;; for a more detailed explanation.
  (setopt custom-file (make-temp-file "emacs-custom-file-" nil ".el"))
#+end_src

* Runtime performance

Performance optimizations belonging in =early-init.el=:
#+name: early-perf-optimizations
#+begin_src emacs-lisp
  ;; Graphical elements of Emacs frame
  <<graphical-elements>>

  ;; Native-compilations settings
  (setq native-comp-jit-compilation t
        native-comp-async-report-warnings-errors 'silent ; Show in *Warnings*  buffer but don't show buffer
        native-comp-async-jobs-number
        (- (string-to-number (string-trim-right (shell-command-to-string "nproc"))) 1)) ; Use as many cores as possible

  ;; NOTE 2024-09-16: From Doom Emacs.  Usually, a second,
  ;; case-insensitive pass over `auto-mode-alist' is time wasted.
  (setopt auto-mode-case-fold nil)
#+end_src

See also:
- [[graphical-elements][These settings place inside =early-init.el=]]
- ~(setopt org-agenda-inhibit-startup t)~

** Garbage collection

Set ~gc-cons-threshold~ to as high a number as possible just for startup.
#+name: garbage-collection-early-init
#+begin_src emacs-lisp
  ;; Defer garbage collection until after starting Emacs by raising
  ;; `gc-cons-threshold' to as high a number as possible.  See also my
  ;; configuration of `gcmh-mode'.
  (setopt gc-cons-threshold most-positive-fixnum)
#+end_src
Then set ~gc-cons-threshold~ to its actual value after initialization:
#+name: garbage-collection-post-init
#+begin_src emacs-lisp
  ;; We set `gc-cons-threshold’ to a high value in early-init.el.  We
  ;; reset the value after initialization.
  (defun krisb-gc-set-options ()
    "Set garbage collection options."
    ;; NOTE 2024-02-11: Please reference
    ;; https://emacsconf.org/2023/talks/gc/ for a statistically-informed
    ;; recommendation for GC variables
    (setopt garbage-collection-messages t
            gc-cons-threshold (* 16 1024 1024) ; 16 mb
            gc-cons-percentage 0.15))
  (add-hook 'after-init-hook #'krisb-gc-set-options)
#+end_src

Some bespoke commands and helper functions related to garbage collection:
#+name: garbage-collection-helpers
#+begin_src emacs-lisp
  ;; Diagnose memory usage: see how Emacs is using memory. From
  ;; https://www.reddit.com/r/emacs/comments/ck4zb3/comment/evji1n7/?utm_source=share&utm_medium=web2x&context=3
  (defun krisb-diagnose-garbage-collect ()
    "Run `garbage-collect' and print stats about memory usage."
    (interactive)
    (message (cl-loop for (type size used free) in (garbage-collect)
                      for used = (* used size)
                      for free = (* (or free 0) size)
                      for total = (file-size-human-readable (+ used free))
                      for used = (file-size-human-readable used)
                      for free = (file-size-human-readable free)
                      concat (format "%s: %s + %s = %s\n" type used free total))))
#+end_src

*** GCMH

#+name: gcmh
#+begin_src emacs-lisp
  ;; Garbage collect when idle.
  ;; TODO 2025-05-23: Document
  ;; - `gcmh-low-cons-threshold’
  (setup gcmh
    ;; Don't load gcmh if this Emacs uses the incremental garbage
    ;; collector (IGC) from the MPS branch.
    (:only-if (not (string-match-p "--with-mps=yes" system-configuration-options)))
    (:package gcmh)

    (:hide-mode)

    (add-hook 'on-first-buffer-hook #'gcmh-mode)

    (setopt gcmh-high-cons-threshold gc-cons-threshold
            ;; If the idle delay is too long, we run the risk of runaway
            ;; memory usage in busy sessions.  And if it's too low, then
            ;; we may as well not be using gcmh at all.  See
            ;; https://emacsconf.org/2023/talks/gc/ for a
            ;; statistically-informed analysis of GC in Emacs.
            gcmh-idle-delay 5
            gcmh-verbose garbage-collection-messages))

  <<gcmh-minibuffer>>
#+end_src

#+name: gcmh-minibuffer
#+begin_src emacs-lisp
  ;; Increase GC threshold when in minibuffer
  (with-eval-after-load 'gcmh
    (defvar krisb-gc-minibuffer--original gcmh-high-cons-threshold
      "Temporary variable to hold `gcmh-high-cons-threshold'")

    (defun krisb-gcmh-minibuffer-setup ()
      "Temporarily have \"limitless\" `gc-cons-threshold'."
      (when gcmh-mode
        (setq gcmh-high-cons-threshold most-positive-fixnum)))

    (defun krisb-gcmh-minibuffer-exit ()
      "Restore value of `gc-cons-threshold'."
      (when gcmh-mode
        (setq gcmh-high-cons-threshold krisb-gc-minibuffer--original)))

    (add-hook 'minibuffer-setup-hook #'krisb-gcmh-minibuffer-setup)
    (add-hook 'minibuffer-exit-hook #'krisb-gcmh-minibuffer-exit)

    ;; Increase `gc-cons-threshold' while using corfu too, like we do
    ;; for the minibuffer
    (with-eval-after-load 'corfu
      (advice-add 'completion-at-point :before #'krisb-gcmh-minibuffer-setup)
      (advice-add 'corfu-quit :after #'krisb-gcmh-minibuffer-exit)
      (advice-add 'corfu-insert :after #'krisb-gcmh-minibuffer-exit)))
#+end_src

** Report total startup time

#+name: startup-time
#+begin_src emacs-lisp
  ;; Message for total init time after startup
  (defun krisb-startup-time ()
    "Report Emacs startup time."
    (message "Total startup time: %s" (emacs-init-time)))
  (add-hook 'after-init-hook #'krisb-startup-time)
#+end_src

* Remove Emacs training wheels

** Don't warn when using disabled commands

#+begin_src emacs-lisp :noweb-ref emacs-misc :noweb-sep "\n\n"
  ;; Enable all disabled commands
  (setopt disabled-command-function nil)
#+end_src

** Don't warn when advising functions

#+begin_src emacs-lisp :noweb-ref emacs-misc :noweb-sep "\n\n"
  ;; Don’t warn when advising
  (setopt ad-redefinition-action 'accept)
#+end_src

* System path

#+name: exec-path-from-shell
#+begin_src emacs-lisp
  ;; Ensure Emacs inherits specified variables from the user environment
  (setup exec-path-from-shell
    (:package exec-path-from-shell)
    (:require)

    (setopt exec-path-from-shell-variables
            '("PATH" "MANPATH" "BROWSER"
              ;; `ssh-agent' environment variables.  See
              ;; https://wiki.archlinux.org/title/SSH_keys#Start_ssh-agent_with_systemd_user
              "SSH_AGENT_PID" "SSH_AUTH_SOCK"))

    (exec-path-from-shell-initialize))
#+end_src

* Graphical and auditory elements

** The Emacs frame

Set UI for the Emacs frame itself (e.g., scroll bars, tool bars, window decorations):
#+name: graphical-elements
#+begin_src emacs-lisp
  ;; NOTE 2024-10-03: From Doom Emacs.  If we're disabling these
  ;; graphical elements, it's faster to do so before they've been
  ;; initialized.
  ;; HACK: I intentionally avoid calling `menu-bar-mode',
  ;;   `tool-bar-mode', and `scroll-bar-mode' because their manipulation
  ;;   of frame parameters can trigger/queue a superfluous (and
  ;;   expensive, depending on the window system) frame redraw at
  ;;   startup. The variables must be set to `nil' as well so users
  ;;   don't have to call the functions twice to re-enable them.
  (push '(menu-bar-lines . 0)   default-frame-alist)
  (push '(tool-bar-lines . 0)   default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  (setq menu-bar-mode nil
        tool-bar-mode nil
        scroll-bar-mode nil)

  ;; Frame defaults
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        use-dialog-box t                  ; For mouse events
        use-file-dialog nil
        inhibit-x-resources t) ; REVIEW 2024-10-03: Not sure the precise effect

  <<frame-transparency>>

  ;; Startup screen
  (setopt inhibit-splash-screen t
          inhibit-startup-screen t
          inhibit-startup-echo-area-message user-login-name ; Read the docstring
          inhibit-startup-buffer-menu t)
#+end_src

*** Transparency

#+name: frame-transparency
#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(alpha-background . 100))
#+end_src

#+name: frame-transparency-toggle
#+begin_src emacs-lisp

  ;; Frame background transparency toggle
  (defun krisb-frame-toggle-transparency (&optional arg)
    "Toggle the value of `alpha-background'.
  Toggles between 100 and 72 by default.  Can choose which value to change
  to if called with ARG, or any prefix argument."
    (interactive "P")
    (let ((transparency (pcase arg
                          ((pred numberp) arg)
                          ((pred car) (read-number "Change the transparency to which value (0-100)? "))
                          (_
                           (pcase (frame-parameter nil 'alpha-background)
                             (72 100)
                             (100 72)
                             (t 100))))))
      (set-frame-parameter nil 'alpha-background transparency)))
  (bind-key "<f9>" #'krisb-frame-toggle-transparency)
#+end_src

** Style

